MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA705/mcu.h
extern volatile CNPUABITS CNPUAbits __attribute__((__sfr__));

#define IOCPUA IOCPUA
extern volatile uint16_t IOCPUA __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
      uint16_t :2;
      uint16_t IOCPA7:1;
      uint16_t IOCPA8:1;
      uint16_t IOCPA9:1;
      uint16_t IOCPA10:1;
      uint16_t IOCPA11:1;
      uint16_t IOCPA12:1;
      uint16_t IOCPA13:1;
      uint16_t IOCPA14:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
      uint16_t :2;
      uint16_t IOCPUA7:1;
      uint16_t IOCPUA8:1;
      uint16_t IOCPUA9:1;
      uint16_t IOCPUA10:1;
      uint16_t IOCPUA11:1;
      uint16_t IOCPUA12:1;
      uint16_t IOCPUA13:1;
      uint16_t IOCPUA14:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
      uint16_t :2;
      uint16_t CNPUA7:1;
      uint16_t CNPUA8:1;
      uint16_t CNPUA9:1;
      uint16_t CNPUA10:1;
      uint16_t CNPUA11:1;
      uint16_t CNPUA12:1;
      uint16_t CNPUA13:1;
      uint16_t CNPUA14:1;
    };
  };
} IOCPUABITS;
extern volatile IOCPUABITS IOCPUAbits __attribute__((__sfr__));

#define CNPDA CNPDA
extern volatile uint16_t CNPDA __attribute__((__sfr__));
__extension__ typedef struct tagCNPDABITS {
  union {
    struct {
      uint16_t IOCPDA0:1;
      uint16_t IOCPDA1:1;
      uint16_t IOCPDA2:1;
      uint16_t IOCPDA3:1;
      uint16_t IOCPDA4:1;
      uint16_t :2;
      uint16_t IOCPDA7:1;
      uint16_t IOCPDA8:1;
      uint16_t IOCPDA9:1;
      uint16_t IOCPDA10:1;
      uint16_t IOCPDA11:1;
      uint16_t IOCPDA12:1;
      uint16_t IOCPDA13:1;
      uint16_t IOCPDA14:1;
    };
    struct {
      uint16_t CNPDA0:1;
      uint16_t CNPDA1:1;
      uint16_t CNPDA2:1;
      uint16_t CNPDA3:1;
      uint16_t CNPDA4:1;
      uint16_t :2;
      uint16_t CNPDA7:1;
      uint16_t CNPDA8:1;
      uint16_t CNPDA9:1;
      uint16_t CNPDA10:1;
      uint16_t CNPDA11:1;
      uint16_t CNPDA12:1;
      uint16_t CNPDA13:1;
      uint16_t CNPDA14:1;
    };
  };
} CNPDABITS;
extern volatile CNPDABITS CNPDAbits __attribute__((__sfr__));

#define IOCPDA IOCPDA
extern volatile uint16_t IOCPDA __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDABITS {
  union {
    struct {
      uint16_t IOCPDA0:1;
      uint16_t IOCPDA1:1;
      uint16_t IOCPDA2:1;
      uint16_t IOCPDA3:1;
      uint16_t IOCPDA4:1;
      uint16_t :2;
      uint16_t IOCPDA7:1;
      uint16_t IOCPDA8:1;
      uint16_t IOCPDA9:1;
      uint16_t IOCPDA10:1;
      uint16_t IOCPDA11:1;
      uint16_t IOCPDA12:1;
      uint16_t IOCPDA13:1;
      uint16_t IOCPDA14:1;
    };
    struct {
      uint16_t CNPDA0:1;
      uint16_t CNPDA1:1;
      uint16_t CNPDA2:1;
      uint16_t CNPDA3:1;
      uint16_t CNPDA4:1;
      uint16_t :2;
      uint16_t CNPDA7:1;
      uint16_t CNPDA8:1;
      uint16_t CNPDA9:1;
      uint16_t CNPDA10:1;
      uint16_t CNPDA11:1;
      uint16_t CNPDA12:1;
      uint16_t CNPDA13:1;
      uint16_t CNPDA14:1;
    };
  };
} IOCPDABITS;
extern volatile IOCPDABITS IOCPDAbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile uint16_t TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  uint16_t TRISB0:1;
  uint16_t TRISB1:1;
  uint16_t TRISB2:1;
  uint16_t TRISB3:1;
  uint16_t TRISB4:1;
  uint16_t TRISB5:1;
  uint16_t TRISB6:1;
  uint16_t TRISB7:1;
  uint16_t TRISB8:1;
  uint16_t TRISB9:1;
  uint16_t TRISB10:1;
  uint16_t TRISB11:1;
  uint16_t TRISB12:1;
  uint16_t TRISB13:1;
  uint16_t TRISB14:1;
  uint16_t TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile uint16_t PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
extern volatile PORTBBITS PORTBbits __attribute__((__sfr__));

#define LATB LATB
extern volatile uint16_t LATB __attribute__((__sfr__));
typedef struct tagLATBBITS {
  uint16_t LATB0:1;
  uint16_t LATB1:1;
  uint16_t LATB2:1;
  uint16_t LATB3:1;
  uint16_t LATB4:1;
  uint16_t LATB5:1;
  uint16_t LATB6:1;
  uint16_t LATB7:1;
  uint16_t LATB8:1;
  uint16_t LATB9:1;
  uint16_t LATB10:1;
  uint16_t LATB11:1;
  uint16_t LATB12:1;
  uint16_t LATB13:1;
  uint16_t LATB14:1;
  uint16_t LATB15:1;
} LATBBITS;
extern volatile LATBBITS LATBbits __attribute__((__sfr__));

#define ODCB ODCB
extern volatile uint16_t ODCB __attribute__((__sfr__));
typedef struct tagODCBBITS {
  uint16_t ODCB0:1;
  uint16_t ODCB1:1;
  uint16_t ODCB2:1;
  uint16_t ODCB3:1;
  uint16_t ODCB4:1;
  uint16_t ODCB5:1;
  uint16_t ODCB6:1;
  uint16_t ODCB7:1;
  uint16_t ODCB8:1;
  uint16_t ODCB9:1;
  uint16_t ODCB10:1;
  uint16_t ODCB11:1;
  uint16_t ODCB12:1;
  uint16_t ODCB13:1;
  uint16_t ODCB14:1;
  uint16_t ODCB15:1;
} ODCBBITS;
extern volatile ODCBBITS ODCBbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t :5;
      uint16_t ANSB9:1;
      uint16_t :2;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t :5;
      uint16_t ANSELB9:1;
      uint16_t :2;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t :5;
      uint16_t ANSB9:1;
      uint16_t :2;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t :5;
      uint16_t ANSELB9:1;
      uint16_t :2;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define IOCPB IOCPB
extern volatile uint16_t IOCPB __attribute__((__sfr__));
typedef struct tagIOCPBBITS {
  uint16_t IOCPB0:1;
  uint16_t IOCPB1:1;
  uint16_t IOCPB2:1;
  uint16_t IOCPB3:1;
  uint16_t IOCPB4:1;
  uint16_t IOCPB5:1;
  uint16_t IOCPB6:1;
  uint16_t IOCPB7:1;
  uint16_t IOCPB8:1;
  uint16_t IOCPB9:1;
  uint16_t IOCPB10:1;
  uint16_t IOCPB11:1;
  uint16_t IOCPB12:1;
  uint16_t IOCPB13:1;
  uint16_t IOCPB14:1;
  uint16_t IOCPB15:1;
} IOCPBBITS;
extern volatile IOCPBBITS IOCPBbits __attribute__((__sfr__));

