MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA705/mcu.h
#define _CNPDA_IOCPDA14_POSITION                 0x0000000E
#define _CNPDA_IOCPDA14_MASK                     0x00004000
#define _CNPDA_IOCPDA14_LENGTH                   0x00000001

#define _CNPDA_CNPDA0_POSITION                   0x00000000
#define _CNPDA_CNPDA0_MASK                       0x00000001
#define _CNPDA_CNPDA0_LENGTH                     0x00000001

#define _CNPDA_CNPDA1_POSITION                   0x00000001
#define _CNPDA_CNPDA1_MASK                       0x00000002
#define _CNPDA_CNPDA1_LENGTH                     0x00000001

#define _CNPDA_CNPDA2_POSITION                   0x00000002
#define _CNPDA_CNPDA2_MASK                       0x00000004
#define _CNPDA_CNPDA2_LENGTH                     0x00000001

#define _CNPDA_CNPDA3_POSITION                   0x00000003
#define _CNPDA_CNPDA3_MASK                       0x00000008
#define _CNPDA_CNPDA3_LENGTH                     0x00000001

#define _CNPDA_CNPDA4_POSITION                   0x00000004
#define _CNPDA_CNPDA4_MASK                       0x00000010
#define _CNPDA_CNPDA4_LENGTH                     0x00000001

#define _CNPDA_CNPDA7_POSITION                   0x00000007
#define _CNPDA_CNPDA7_MASK                       0x00000080
#define _CNPDA_CNPDA7_LENGTH                     0x00000001

#define _CNPDA_CNPDA8_POSITION                   0x00000008
#define _CNPDA_CNPDA8_MASK                       0x00000100
#define _CNPDA_CNPDA8_LENGTH                     0x00000001

#define _CNPDA_CNPDA9_POSITION                   0x00000009
#define _CNPDA_CNPDA9_MASK                       0x00000200
#define _CNPDA_CNPDA9_LENGTH                     0x00000001

#define _CNPDA_CNPDA10_POSITION                  0x0000000A
#define _CNPDA_CNPDA10_MASK                      0x00000400
#define _CNPDA_CNPDA10_LENGTH                    0x00000001

#define _CNPDA_CNPDA11_POSITION                  0x0000000B
#define _CNPDA_CNPDA11_MASK                      0x00000800
#define _CNPDA_CNPDA11_LENGTH                    0x00000001

#define _CNPDA_CNPDA12_POSITION                  0x0000000C
#define _CNPDA_CNPDA12_MASK                      0x00001000
#define _CNPDA_CNPDA12_LENGTH                    0x00000001

#define _CNPDA_CNPDA13_POSITION                  0x0000000D
#define _CNPDA_CNPDA13_MASK                      0x00002000
#define _CNPDA_CNPDA13_LENGTH                    0x00000001

#define _CNPDA_CNPDA14_POSITION                  0x0000000E
#define _CNPDA_CNPDA14_MASK                      0x00004000
#define _CNPDA_CNPDA14_LENGTH                    0x00000001

#define _IOCPDA_IOCPDA0_POSITION                 0x00000000
#define _IOCPDA_IOCPDA0_MASK                     0x00000001
#define _IOCPDA_IOCPDA0_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA1_POSITION                 0x00000001
#define _IOCPDA_IOCPDA1_MASK                     0x00000002
#define _IOCPDA_IOCPDA1_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA2_POSITION                 0x00000002
#define _IOCPDA_IOCPDA2_MASK                     0x00000004
#define _IOCPDA_IOCPDA2_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA3_POSITION                 0x00000003
#define _IOCPDA_IOCPDA3_MASK                     0x00000008
#define _IOCPDA_IOCPDA3_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA4_POSITION                 0x00000004
#define _IOCPDA_IOCPDA4_MASK                     0x00000010
#define _IOCPDA_IOCPDA4_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA7_POSITION                 0x00000007
#define _IOCPDA_IOCPDA7_MASK                     0x00000080
#define _IOCPDA_IOCPDA7_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA8_POSITION                 0x00000008
#define _IOCPDA_IOCPDA8_MASK                     0x00000100
#define _IOCPDA_IOCPDA8_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA9_POSITION                 0x00000009
#define _IOCPDA_IOCPDA9_MASK                     0x00000200
#define _IOCPDA_IOCPDA9_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA10_POSITION                0x0000000A
#define _IOCPDA_IOCPDA10_MASK                    0x00000400
#define _IOCPDA_IOCPDA10_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA11_POSITION                0x0000000B
#define _IOCPDA_IOCPDA11_MASK                    0x00000800
#define _IOCPDA_IOCPDA11_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA12_POSITION                0x0000000C
#define _IOCPDA_IOCPDA12_MASK                    0x00001000
#define _IOCPDA_IOCPDA12_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA13_POSITION                0x0000000D
#define _IOCPDA_IOCPDA13_MASK                    0x00002000
#define _IOCPDA_IOCPDA13_LENGTH                  0x00000001

#define _IOCPDA_IOCPDA14_POSITION                0x0000000E
#define _IOCPDA_IOCPDA14_MASK                    0x00004000
#define _IOCPDA_IOCPDA14_LENGTH                  0x00000001

#define _IOCPDA_CNPDA0_POSITION                  0x00000000
#define _IOCPDA_CNPDA0_MASK                      0x00000001
#define _IOCPDA_CNPDA0_LENGTH                    0x00000001

#define _IOCPDA_CNPDA1_POSITION                  0x00000001
#define _IOCPDA_CNPDA1_MASK                      0x00000002
#define _IOCPDA_CNPDA1_LENGTH                    0x00000001

#define _IOCPDA_CNPDA2_POSITION                  0x00000002
#define _IOCPDA_CNPDA2_MASK                      0x00000004
#define _IOCPDA_CNPDA2_LENGTH                    0x00000001

#define _IOCPDA_CNPDA3_POSITION                  0x00000003
#define _IOCPDA_CNPDA3_MASK                      0x00000008
#define _IOCPDA_CNPDA3_LENGTH                    0x00000001

#define _IOCPDA_CNPDA4_POSITION                  0x00000004
#define _IOCPDA_CNPDA4_MASK                      0x00000010
#define _IOCPDA_CNPDA4_LENGTH                    0x00000001

#define _IOCPDA_CNPDA7_POSITION                  0x00000007
#define _IOCPDA_CNPDA7_MASK                      0x00000080
#define _IOCPDA_CNPDA7_LENGTH                    0x00000001

#define _IOCPDA_CNPDA8_POSITION                  0x00000008
#define _IOCPDA_CNPDA8_MASK                      0x00000100
#define _IOCPDA_CNPDA8_LENGTH                    0x00000001

#define _IOCPDA_CNPDA9_POSITION                  0x00000009
#define _IOCPDA_CNPDA9_MASK                      0x00000200
#define _IOCPDA_CNPDA9_LENGTH                    0x00000001

